In [35]:
#Adding Panadas dependency
import pandas as pd
import os

In [36]:
#Load CSV Files
school_data_to_load = os.path.join("Resources","schools_complete.csv")
student_data_to_load = os.path.join("Resources","students_complete.csv")

In [37]:
#Reading CSV Files
studentDataDf = pd.read_csv(student_data_to_load)
schoolDataDf = pd.read_csv(school_data_to_load)

#Skipping header row in CSV files
schoolDataDf.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [38]:
studentDataDf.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [39]:
#Checking for missing data with "count()"
schoolDataDf.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [40]:
#Checking for missing data with "count()"
studentDataDf.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [41]:
#Checking for missing data with "isnull()"
schoolDataDf.isnull()

    School ID  school_name   type   size  budget
0       False        False  False  False   False
1       False        False  False  False   False
2       False        False  False  False   False
3       False        False  False  False   False
4       False        False  False  False   False
5       False        False  False  False   False
6       False        False  False  False   False
7       False        False  False  False   False
8       False        False  False  False   False
9       False        False  False  False   False
10      False        False  False  False   False
11      False        False  False  False   False
12      False        False  False  False   False
13      False        False  False  False   False
14      False        False  False  False   False

In [42]:
#Checking for missing data with "isnull()"
studentDataDf.isnull()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...
39165,False,False,False,False,False,False,False
39166,False,False,False,False,False,False,False
39167,False,False,False,False,False,False,False
39168,False,False,False,False,False,False,False
39169,False,False,False,False,False,False,False

In [43]:
#Checking for missing data by chaining "sum()" with "isnull()"
studentDataDf.isnull().sum()

Student ID       0
student_name     0
gender           0
grade            0
school_name      0
reading_score    0
math_score       0
dtype: int64

In [44]:
#Checking for missing data with "notnull()"
schoolDataDf.notnull()

    School ID  school_name  type  size  budget
0        True         True  True  True    True
1        True         True  True  True    True
2        True         True  True  True    True
3        True         True  True  True    True
4        True         True  True  True    True
5        True         True  True  True    True
6        True         True  True  True    True
7        True         True  True  True    True
8        True         True  True  True    True
9        True         True  True  True    True
10       True         True  True  True    True
11       True         True  True  True    True
12       True         True  True  True    True
13       True         True  True  True    True
14       True         True  True  True    True

In [45]:
#Checking for missing data by chaining "sum()" with "notnull()"
studentDataDf.notnull().sum()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [46]:
#Checking column data types
studentDataDf.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [47]:
schoolDataDf.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [48]:
# Adding each prefix and suffix to remove to a list.
prefixes_suffixes = ["Dr. ", "Mr. ","Ms. ", "Mrs. ", "Miss ", " MD", " DDS", " DVM", " PhD"]

#Iterating through each "student_name",
#checking for and remove any prefixes or suffixes
for words in prefixes_suffixes:
    #replacing prefix or suffix with nothing
    studentDataDf['student_name'] = studentDataDf['student_name'].str.replace(words,'',regex=False)
studentDataDf

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84
...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75

In [49]:
# Combine the data into a single dataset.
schoolDataCompleteDf = pd.merge(studentDataDf, schoolDataDf, on=['school_name','school_name'])
schoolDataCompleteDf.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [50]:
studentCount = schoolDataCompleteDf['Student ID'].count()
studentCount

39170

In [51]:
# Calculate the total number of schools.
schoolCount = schoolDataDf['school_name'].count()
schoolCount

15

In [52]:
schoolCount2 = schoolDataCompleteDf['school_name'].unique()
len(schoolCount2)

15

In [53]:
# Calculate total budget
totalBudget = schoolDataDf['budget'].sum()
totalBudget

24649428

In [54]:
# Calculate average reading score
avgReading = schoolDataCompleteDf['reading_score'].mean()
avgReading

81.87784018381414

In [55]:
# Calculating average math score
avgMath = schoolDataCompleteDf['math_score'].mean()
avgMath

78.98537145774827

In [56]:
# Get passing math grades
passingMath = schoolDataCompleteDf['math_score'] >= 70

In [57]:
passingMath.head(10)

0     True
1    False
2    False
3    False
4     True
5     True
6     True
7    False
8     True
9     True
Name: math_score, dtype: bool

In [58]:
# Get all the students who are passing math in a new DataFrame.
passingMath = schoolDataCompleteDf[schoolDataCompleteDf['math_score'] >= 70]
passingMath.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635

In [59]:
# Get all the students that are passing reading in a new DataFrame.
passingReading = schoolDataCompleteDf[schoolDataCompleteDf['reading_score'] >= 70]
passingReading.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635

In [60]:
# Calculate the number of students passing math.
passingMathCount = passingMath['student_name'].count()

# Calculate the number of students passing reading.
passingReadingCount = passingReading['student_name'].count()

print("Passing math count: " + str(passingMathCount))
print("Passing reading count: " + str(passingReadingCount))

Passing math count: 29370
Passing reading count: 33610

In [61]:
#Calculating passing percentages
passingReadingPerc = passingReadingCount / float(studentCount) * 100
passingMathPerc = passingMathCount / float(studentCount) * 100
print(f'Passing math percentage {passingMathPerc}\n'
      f'Passing reading percentage {passingReadingPerc}')

Passing math percentage 74.9808526933878
Passing reading percentage 85.80546336482001

In [62]:
#Looking for students that passed BOTH math and reading
passingBoth = schoolDataCompleteDf[(schoolDataCompleteDf['math_score'] >= 70) & (schoolDataCompleteDf['reading_score'] >= 70)]

passingBoth.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5,5,Bryan Miranda,M,9th,Huang High School,94,94,0,District,2917,1910635
6,6,Sheena Carter,F,11th,Huang High School,82,80,0,District,2917,1910635
8,8,Michael Roth,M,10th,Huang High School,95,87,0,District,2917,1910635
9,9,Matthew Greene,M,10th,Huang High School,96,84,0,District,2917,1910635

In [63]:
#Get count of students who passed BOTH math & english
passingBothCount = passingBoth['student_name'].count()
passingBothCount

25528

In [64]:
#Calculate passing both percentage
passingBothPerc = passingBothCount / studentCount * 100
passingBothPerc

65.17232575950983

In [65]:
districtSummaryDf = pd.DataFrame(
    [{"Total Schools": schoolCount,
      "Total Students": studentCount,
      "Total Budget": totalBudget,
      "Average Math Score": avgMath,
      "Average Reading Score": avgReading,
      "% Passing Math": passingMathPerc,
      "% Passing Reading": passingReadingPerc,
      "% Overall Passing": passingBothPerc}])
districtSummaryDf

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463,65.172326

In [66]:
# Format the "Total Students" to have the comma for a thousands separator.
districtSummaryDf['Total Students'] = districtSummaryDf['Total Students'].map('{:,}'.format)

districtSummaryDf['Total Students']

0    39,170
Name: Total Students, dtype: object

In [67]:
districtSummaryDf['Total Budget'] = districtSummaryDf['Total Budget'].map("${:,.2f}".format)

districtSummaryDf['Total Budget']

0    $24,649,428.00
Name: Total Budget, dtype: object

In [68]:
#Formatting all columns
districtSummaryDf['Average Math Score'] = districtSummaryDf['Average Math Score'].map('{:.1f}'.format)

districtSummaryDf['Average Reading Score'] = districtSummaryDf['Average Reading Score'].map('{:.1f}'.format)

districtSummaryDf['% Passing Reading'] = districtSummaryDf['% Passing Reading'].map('{:.0f}'.format)

districtSummaryDf['% Passing Math'] = districtSummaryDf['% Passing Math'].map('{:.0f}'.format)

districtSummaryDf['% Overall Passing'] = districtSummaryDf['% Overall Passing'].map('{:.0f}'.format)

In [70]:
districtSummaryDf

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,% Passing Math,% Passing Reading,% Overall Passing
0,15,"39,170","$24,649,428.00",79.0,81.9,75,86,65